{
  "Tomato___Late_blight": {
    "description": "A serious fungal disease caused by Phytophthora infestans that affects tomatoes and potatoes. It spreads rapidly in cool, wet conditions and can destroy entire crops within days.",
    "remedy": "Remove and destroy infected plants immediately. Apply copper-based fungicides preventively. Improve air circulation by spacing plants properly. Avoid overhead irrigation. Use resistant varieties when possible."
  },
  "Tomato___Early_blight": {
    "description": "A fungal disease caused by Alternaria solani that affects tomato leaves, stems, and fruits. It typically appears as dark brown spots with concentric rings.",
    "remedy": "Remove infected leaves and destroy them. Apply fungicides containing chlorothalonil or copper. Mulch around plants to prevent soil splash. Water at the base of plants. Rotate crops annually."
  },
  "Tomato___Leaf_Mold": {
    "description": "A fungal disease caused by Passalora fulva that thrives in high humidity and poor air circulation. It appears as yellow spots on upper leaf surfaces with olive-green spores underneath.",
    "remedy": "Improve air circulation by spacing plants properly. Reduce humidity by watering early in the day. Apply fungicides if necessary. Remove and destroy infected leaves. Use resistant varieties."
  },
  "Tomato___Septoria_leaf_spot": {
    "description": "A fungal disease caused by Septoria lycopersici that creates small, circular spots with dark borders and gray centers on tomato leaves.",
    "remedy": "Remove infected leaves immediately. Apply fungicides containing copper or chlorothalonil. Mulch to prevent soil splash. Water at the base of plants. Rotate crops and clean up debris."
  },
  "Tomato___Spider_mites_Two_spotted_spider_mite": {
    "description": "Tiny arachnids that feed on plant sap, causing stippling, yellowing, and webbing on tomato leaves. They thrive in hot, dry conditions.",
    "remedy": "Spray plants with strong water to dislodge mites. Apply insecticidal soap or neem oil. Introduce predatory mites. Maintain adequate humidity. Remove heavily infested leaves."
  },
  "Tomato___Target_Spot": {
    "description": "A fungal disease caused by Corynespora cassiicola that creates target-like lesions with concentric rings on tomato leaves and stems.",
    "remedy": "Remove infected plant parts. Apply fungicides containing azoxystrobin or chlorothalonil. Improve air circulation. Avoid overhead irrigation. Use resistant varieties when available."
  },
  "Tomato___Yellow_Leaf_Curl_Virus": {
    "description": "A viral disease transmitted by whiteflies that causes yellowing, curling, and stunting of tomato leaves. It can significantly reduce yields.",
    "remedy": "Control whiteflies with insecticides or sticky traps. Remove infected plants immediately. Use resistant varieties. Plant early to avoid peak whitefly season. Use reflective mulches."
  },
  "Tomato___mosaic_virus": {
    "description": "A viral disease that causes mottled, distorted leaves and reduced fruit quality. It can be transmitted by insects, tools, or human contact.",
    "remedy": "Remove and destroy infected plants. Control aphids and other insect vectors. Disinfect tools between plants. Wash hands after handling infected plants. Use resistant varieties."
  },
  "Tomato___healthy": {
    "description": "Healthy tomato plant with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular watering, fertilization, and monitoring for early signs of problems."
  },
  "Potato___Early_blight": {
    "description": "A fungal disease caused by Alternaria solani that affects potato leaves, creating dark brown spots with concentric rings. It can reduce yields and tuber quality.",
    "remedy": "Remove infected leaves. Apply fungicides containing chlorothalonil or copper. Mulch to prevent soil splash. Water at the base of plants. Rotate crops and clean up debris."
  },
  "Potato___Late_blight": {
    "description": "A devastating fungal disease caused by Phytophthora infestans that can destroy entire potato crops rapidly in cool, wet conditions.",
    "remedy": "Remove and destroy infected plants immediately. Apply copper-based fungicides preventively. Improve drainage and air circulation. Avoid overhead irrigation. Use resistant varieties."
  },
  "Potato___healthy": {
    "description": "Healthy potato plant with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular watering, fertilization, and monitoring for early signs of problems."
  },
  "Pepper_bell___Bacterial_spot": {
    "description": "A bacterial disease caused by Xanthomonas campestris that creates small, water-soaked spots on pepper leaves and fruits. It can spread rapidly in wet conditions.",
    "remedy": "Remove infected plant parts. Avoid overhead irrigation. Apply copper-based bactericides. Improve air circulation. Use disease-free seeds. Rotate crops annually."
  },
  "Pepper_bell___healthy": {
    "description": "Healthy bell pepper plant with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular watering, fertilization, and monitoring for early signs of problems."
  },
  "Peach___Bacterial_spot": {
    "description": "A bacterial disease caused by Xanthomonas arboricola that creates small, angular spots on peach leaves and fruits. It can cause fruit drop and reduced quality.",
    "remedy": "Apply copper-based bactericides during dormancy and early spring. Prune to improve air circulation. Remove and destroy infected plant parts. Use resistant varieties when available."
  },
  "Peach___healthy": {
    "description": "Healthy peach tree with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular pruning, fertilization, and monitoring for early signs of problems."
  },
  "Strawberry___Leaf_scorch": {
    "description": "A fungal disease caused by Diplocarpon earlianum that creates purple spots on strawberry leaves, eventually causing leaf death and reduced fruit production.",
    "remedy": "Remove infected leaves and debris. Apply fungicides containing captan or thiram. Improve air circulation. Avoid overhead irrigation. Use resistant varieties and clean planting material."
  },
  "Strawberry___healthy": {
    "description": "Healthy strawberry plant with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular watering, fertilization, and monitoring for early signs of problems."
  },
  "Apple___Apple_scab": {
    "description": "A fungal disease caused by Venturia inaequalis that creates dark, scabby lesions on apple leaves and fruits. It can cause significant yield losses and fruit quality issues.",
    "remedy": "Apply fungicides during early spring. Prune to improve air circulation. Remove and destroy fallen leaves and fruit. Use resistant varieties. Apply dormant oil sprays."
  },
  "Apple___Black_rot": {
    "description": "A fungal disease caused by Botryosphaeria obtusa that affects apple fruits, leaves, and branches. It can cause fruit rot and canker formation on branches.",
    "remedy": "Prune and destroy infected branches. Remove mummified fruits. Apply fungicides during bloom and early fruit development. Improve air circulation through proper pruning."
  },
  "Apple___Cedar_apple_rust": {
    "description": "A fungal disease that requires both apple trees and cedar trees to complete its life cycle. It creates orange spots on apple leaves and fruits.",
    "remedy": "Remove cedar trees within 2 miles if possible. Apply fungicides during early spring. Use resistant apple varieties. Prune to improve air circulation. Remove infected plant parts."
  },
  "Apple___healthy": {
    "description": "Healthy apple tree with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular pruning, fertilization, and monitoring for early signs of problems."
  },
  "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": {
    "description": "A fungal disease caused by Cercospora zeae-maydis that creates rectangular, gray-brown lesions on corn leaves. It can reduce yields in severe cases.",
    "remedy": "Use resistant hybrids. Apply fungicides if necessary. Rotate crops. Remove and destroy crop debris. Ensure proper plant spacing for air circulation."
  },
  "Corn_(maize)___Common_rust": {
    "description": "A fungal disease caused by Puccinia sorghi that creates reddish-brown pustules on corn leaves. It typically doesn't cause significant yield loss in most cases.",
    "remedy": "Use resistant hybrids. Apply fungicides only if disease pressure is high. Remove volunteer corn plants. Rotate crops. Monitor for early detection."
  },
  "Corn_(maize)___healthy": {
    "description": "Healthy corn plant with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular watering, fertilization, and monitoring for early signs of problems."
  },
  "Grape___Black_rot": {
    "description": "A fungal disease caused by Guignardia bidwellii that affects grape leaves, stems, and fruits. It can cause significant yield losses and fruit quality issues.",
    "remedy": "Apply fungicides during early spring and bloom. Prune to improve air circulation. Remove and destroy infected plant parts. Use resistant varieties when available."
  },
  "Grape___Esca_(Black_Measles)": {
    "description": "A fungal disease that affects grape wood and can cause leaf symptoms, fruit rot, and eventual vine death. It's difficult to control once established.",
    "remedy": "Prune and destroy infected wood. Apply fungicides during dormancy. Improve vine health through proper nutrition and irrigation. Use disease-free planting material."
  },
  "Grape___healthy": {
    "description": "Healthy grape vine with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular pruning, fertilization, and monitoring for early signs of problems."
  },
  "Cherry_(including_sour)___healthy": {
    "description": "Healthy cherry tree with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular pruning, fertilization, and monitoring for early signs of problems."
  },
  "Peach___healthy": {
    "description": "Healthy peach tree with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular pruning, fertilization, and monitoring for early signs of problems."
  },
  "Raspberry___healthy": {
    "description": "Healthy raspberry plant with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular pruning, fertilization, and monitoring for early signs of problems."
  },
  "Soybean___healthy": {
    "description": "Healthy soybean plant with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular watering, fertilization, and monitoring for early signs of problems."
  },
  "Squash___Powdery_mildew": {
    "description": "A fungal disease that creates white, powdery patches on squash leaves. It can reduce yields and plant vigor, especially in humid conditions.",
    "remedy": "Apply fungicides containing sulfur or neem oil. Improve air circulation through proper spacing. Remove infected leaves. Use resistant varieties when available. Avoid overhead irrigation."
  },
  "Squash___healthy": {
    "description": "Healthy squash plant with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular watering, fertilization, and monitoring for early signs of problems."
  },
  "Orange___Haunglongbing_(Citrus_greening)": {
    "description": "A bacterial disease transmitted by Asian citrus psyllids that causes yellowing, stunting, and poor fruit quality. It's one of the most serious citrus diseases worldwide.",
    "remedy": "Control psyllids with insecticides. Remove infected trees immediately. Use disease-free planting material. Monitor regularly for early detection. Implement quarantine measures."
  },
  "Orange___healthy": {
    "description": "Healthy orange tree with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular pruning, fertilization, and monitoring for early signs of problems."
  },
  "Blueberry___healthy": {
    "description": "Healthy blueberry plant with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular pruning, fertilization, and monitoring for early signs of problems."
  },
  "Cucumber___healthy": {
    "description": "Healthy cucumber plant with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular watering, fertilization, and monitoring for early signs of problems."
  },
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": {
    "description": "A fungal disease that creates angular, brown lesions on grape leaves. It can cause defoliation and reduce fruit quality in severe cases.",
    "remedy": "Apply fungicides during early spring and throughout the growing season. Prune to improve air circulation. Remove and destroy infected plant parts. Use resistant varieties when available."
  },
  "Grape___healthy": {
    "description": "Healthy grape vine with no visible signs of disease or pest damage.",
    "remedy": "Continue current care practices. Maintain regular pruning, fertilization, and monitoring for early signs of problems."
  }
}
